layer {
  name: "data"
  type: "Data"
  top: "data"
  transform_param {
    scale: 1.52587890625e-05
  }
  data_param {
    source: "berkley-test-image-lmdb-srcnn"
    batch_size: 10
    backend: LMDB
  }
}
layer {
  name: "orim"
  type: "Data"
  top: "orim"
  transform_param {
    scale: 1.52587890625e-05
  }
  data_param {
    source: "berkley-test-orim-image-lmdb-srcnn"
    batch_size: 10
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    kernel_size: 9
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  convolution_param {
    num_output: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "conv3"
  bottom: "orim"
  top: "loss"
}
